zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/gpio_reg.h
    __IO uint32_t INT0_INNF;     /* Offset: 0x440  INT0 Input Noise Filter Register                                             */
    __IO uint32_t INT0_EDETCTL;  /* Offset: 0x444  INT0 Edge Detect Control Register                                            */
    __IO uint32_t INT0_EDINTEN;  /* Offset: 0x448  INT0 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT0_EDSTS;    /* Offset: 0x44c  INT0 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE0[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT1_INNF;     /* Offset: 0x460  INT1 Input Noise Filter Register                                             */
    __IO uint32_t INT1_EDETCTL;  /* Offset: 0x464  INT1 Edge Detect Control Register                                            */
    __IO uint32_t INT1_EDINTEN;  /* Offset: 0x468  INT1 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT1_EDSTS;    /* Offset: 0x46c  INT1 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE1[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT2_INNF;     /* Offset: 0x480  INT2 Input Noise Filter Register                                             */
    __IO uint32_t INT2_EDETCTL;  /* Offset: 0x484  INT2 Edge Detect Control Register                                            */
    __IO uint32_t INT2_EDINTEN;  /* Offset: 0x488  INT2 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT2_EDSTS;    /* Offset: 0x48c  INT2 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE2[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT3_INNF;     /* Offset: 0x4a0  INT3 Input Noise Filter Register                                             */
    __IO uint32_t INT3_EDETCTL;  /* Offset: 0x4a4  INT3 Edge Detect Control Register                                            */
    __IO uint32_t INT3_EDINTEN;  /* Offset: 0x4a8  INT3 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT3_EDSTS;    /* Offset: 0x4ac  INT3 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE3[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT4_INNF;     /* Offset: 0x4c0  INT4 Input Noise Filter Register                                             */
    __IO uint32_t INT4_EDETCTL;  /* Offset: 0x4c4  INT4 Edge Detect Control Register                                            */
    __IO uint32_t INT4_EDINTEN;  /* Offset: 0x4c8  INT4 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT4_EDSTS;    /* Offset: 0x4cc  INT4 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE4[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT5_INNF;     /* Offset: 0x4e0  INT5 Input Noise Filter Register                                             */
    __IO uint32_t INT5_EDETCTL;  /* Offset: 0x4e4  INT5 Edge Detect Control Register                                            */
    __IO uint32_t INT5_EDINTEN;  /* Offset: 0x4e8  INT5 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT5_EDSTS;    /* Offset: 0x4ec  INT5 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE5[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT6_INNF;     /* Offset: 0x500  INT6 Input Noise Filter Register                                             */
    __IO uint32_t INT6_EDETCTL;  /* Offset: 0x504  INT6 Edge Detect Control Register                                            */
    __IO uint32_t INT6_EDINTEN;  /* Offset: 0x508  INT6 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT6_EDSTS;    /* Offset: 0x50c  INT6 Edge Detect Interrupt Flag Register                                     */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE6[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t INT7_INNF;     /* Offset: 0x520  INT7 Input Noise Filter Register                                             */
    __IO uint32_t INT7_EDETCTL;  /* Offset: 0x524  INT7 Edge Detect Control Register                                            */
    __IO uint32_t INT7_EDINTEN;  /* Offset: 0x528  INT7 Edge Detect Interrupt Enable Control Register                           */
    __IO uint32_t INT7_EDSTS;    /* Offset: 0x52c  INT7 Edge Detect Interrupt Flag Register                                     */

} GPIO_INT_T;

/**
    @addtogroup GPIO_CONST GPIO Bit Field Definition
    Constant Definitions for GPIO Controller
@{ */

#define GPIO_MODE_MODE0_Pos              (0)                                               /*!< GPIO_T::MODE: MODE0 Position              */
#define GPIO_MODE_MODE0_Msk              (0x3ul << GPIO_MODE_MODE0_Pos)                    /*!< GPIO_T::MODE: MODE0 Mask                  */

#define GPIO_MODE_MODE1_Pos              (2)                                               /*!< GPIO_T::MODE: MODE1 Position              */
#define GPIO_MODE_MODE1_Msk              (0x3ul << GPIO_MODE_MODE1_Pos)                    /*!< GPIO_T::MODE: MODE1 Mask                  */

#define GPIO_MODE_MODE2_Pos              (4)                                               /*!< GPIO_T::MODE: MODE2 Position              */
#define GPIO_MODE_MODE2_Msk              (0x3ul << GPIO_MODE_MODE2_Pos)                    /*!< GPIO_T::MODE: MODE2 Mask                  */

#define GPIO_MODE_MODE3_Pos              (6)                                               /*!< GPIO_T::MODE: MODE3 Position              */
#define GPIO_MODE_MODE3_Msk              (0x3ul << GPIO_MODE_MODE3_Pos)                    /*!< GPIO_T::MODE: MODE3 Mask                  */

#define GPIO_MODE_MODE4_Pos              (8)                                               /*!< GPIO_T::MODE: MODE4 Position              */
#define GPIO_MODE_MODE4_Msk              (0x3ul << GPIO_MODE_MODE4_Pos)                    /*!< GPIO_T::MODE: MODE4 Mask                  */

#define GPIO_MODE_MODE5_Pos              (10)                                              /*!< GPIO_T::MODE: MODE5 Position              */
#define GPIO_MODE_MODE5_Msk              (0x3ul << GPIO_MODE_MODE5_Pos)                    /*!< GPIO_T::MODE: MODE5 Mask                  */

#define GPIO_MODE_MODE6_Pos              (12)                                              /*!< GPIO_T::MODE: MODE6 Position              */
#define GPIO_MODE_MODE6_Msk              (0x3ul << GPIO_MODE_MODE6_Pos)                    /*!< GPIO_T::MODE: MODE6 Mask                  */

#define GPIO_MODE_MODE7_Pos              (14)                                              /*!< GPIO_T::MODE: MODE7 Position              */
#define GPIO_MODE_MODE7_Msk              (0x3ul << GPIO_MODE_MODE7_Pos)                    /*!< GPIO_T::MODE: MODE7 Mask                  */

