zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/gpio_reg.h
#define GPIO_PUSEL_PUSEL6_Pos            (12)                                              /*!< GPIO_T::PUSEL: PUSEL6 Position         */
#define GPIO_PUSEL_PUSEL6_Msk            (0x3ul << GPIO_PUSEL_PUSEL6_Pos)                  /*!< GPIO_T::PUSEL: PUSEL6 Mask             */

#define GPIO_PUSEL_PUSEL7_Pos            (14)                                              /*!< GPIO_T::PUSEL: PUSEL7 Position         */
#define GPIO_PUSEL_PUSEL7_Msk            (0x3ul << GPIO_PUSEL_PUSEL7_Pos)                  /*!< GPIO_T::PUSEL: PUSEL7 Mask             */

#define GPIO_PUSEL_PUSEL8_Pos            (16)                                              /*!< GPIO_T::PUSEL: PUSEL8 Position         */
#define GPIO_PUSEL_PUSEL8_Msk            (0x3ul << GPIO_PUSEL_PUSEL8_Pos)                  /*!< GPIO_T::PUSEL: PUSEL8 Mask             */

#define GPIO_PUSEL_PUSEL9_Pos            (18)                                              /*!< GPIO_T::PUSEL: PUSEL9 Position         */
#define GPIO_PUSEL_PUSEL9_Msk            (0x3ul << GPIO_PUSEL_PUSEL9_Pos)                  /*!< GPIO_T::PUSEL: PUSEL9 Mask             */

#define GPIO_PUSEL_PUSEL10_Pos           (20)                                              /*!< GPIO_T::PUSEL: PUSEL10 Position        */
#define GPIO_PUSEL_PUSEL10_Msk           (0x3ul << GPIO_PUSEL_PUSEL10_Pos)                 /*!< GPIO_T::PUSEL: PUSEL10 Mask            */

#define GPIO_PUSEL_PUSEL11_Pos           (22)                                              /*!< GPIO_T::PUSEL: PUSEL11 Position        */
#define GPIO_PUSEL_PUSEL11_Msk           (0x3ul << GPIO_PUSEL_PUSEL11_Pos)                 /*!< GPIO_T::PUSEL: PUSEL11 Mask            */

#define GPIO_PUSEL_PUSEL12_Pos           (24)                                              /*!< GPIO_T::PUSEL: PUSEL12 Position        */
#define GPIO_PUSEL_PUSEL12_Msk           (0x3ul << GPIO_PUSEL_PUSEL12_Pos)                 /*!< GPIO_T::PUSEL: PUSEL12 Mask            */

#define GPIO_PUSEL_PUSEL13_Pos           (26)                                              /*!< GPIO_T::PUSEL: PUSEL13 Position        */
#define GPIO_PUSEL_PUSEL13_Msk           (0x3ul << GPIO_PUSEL_PUSEL13_Pos)                 /*!< GPIO_T::PUSEL: PUSEL13 Mask            */

#define GPIO_PUSEL_PUSEL14_Pos           (28)                                              /*!< GPIO_T::PUSEL: PUSEL14 Position        */
#define GPIO_PUSEL_PUSEL14_Msk           (0x3ul << GPIO_PUSEL_PUSEL14_Pos)                 /*!< GPIO_T::PUSEL: PUSEL14 Mask            */

#define GPIO_PUSEL_PUSEL15_Pos           (30)                                              /*!< GPIO_T::PUSEL: PUSEL15 Position        */
#define GPIO_PUSEL_PUSEL15_Msk           (0x3ul << GPIO_PUSEL_PUSEL15_Pos)                 /*!< GPIO_T::PUSEL: PUSEL15 Mask            */

#define GPIO_DBCTL_DBCLKSEL_Pos          (0)                                               /*!< GPIO_T::DBCTL: DBCLKSEL Position       */
#define GPIO_DBCTL_DBCLKSEL_Msk          (0xFul << GPIO_DBCTL_DBCLKSEL_Pos)                /*!< GPIO_T::DBCTL: DBCLKSEL Mask           */

#define GPIO_DBCTL_DBCLKSRC_Pos          (4)                                               /*!< GPIO_T::DBCTL: DBCLKSRC Position       */
#define GPIO_DBCTL_DBCLKSRC_Msk          (1ul << GPIO_DBCTL_DBCLKSRC_Pos)                  /*!< GPIO_T::DBCTL: DBCLKSRC Mask           */

#define GPIO_DBCTL_ICLKON_Pos            (5)                                               /*!< GPIO_T::DBCTL: ICLKON Position         */
#define GPIO_DBCTL_ICLKON_Msk            (1ul << GPIO_DBCTL_ICLKON_Pos)                    /*!< GPIO_T::DBCTL: ICLKON Mask             */

#define GPIO_DBCTL_DBCLKBUSY_Pos         (31)                                              /*!< GPIO_T::DBCTL: DBCLKBUSY Position      */
#define GPIO_DBCTL_DBCLKBUSY_Msk         (1ul << GPIO_DBCTL_DBCLKBUSY_Pos)                 /*!< GPIO_T::DBCTL: DBCLKBUSY Mask          */

#define GPIO_INT_INNF_NFEN_Pos           (0)                                               /*!< GPIO_T::INT_INNF: NFEN Position        */
#define GPIO_INT_INNF_NFEN_Msk           (0x1ul << GPIO_INT_INNF_NFEN_Pos)                 /*!< GPIO_T::INT_INNF: NFEN Mask            */

#define GPIO_INT_INNF_NFSEL_Pos          (4)                                               /*!< GPIO_T::INT_INNF: NFSEL Position       */
#define GPIO_INT_INNF_NFSEL_Msk          (0x7ul << GPIO_INT_INNF_NFSEL_Pos)                /*!< GPIO_T::INT_INNF: NFSEL Mask           */

#define GPIO_INT_INNF_NFCNT_Pos          (8)                                               /*!< GPIO_T::INT_INNF: NFCNT Position       */
#define GPIO_INT_INNF_NFCNT_Msk          (0x7ul << GPIO_INT_INNF_NFCNT_Pos)                /*!< GPIO_T::INT_INNF: NFCNT Mask           */

#define GPIO_INT_EDETCTL_EDETCTL_Pos     (0)                                               /*!< GPIO_T::INT_EDETCTL: EDETCTL Position  */
#define GPIO_INT_EDETCTL_EDETCTL_Msk     (0x3ul << GPIO_INT_EDETCTL_EDETCTL_Pos)           /*!< GPIO_T::INT_EDETCTL: EDETCTL Mask      */

#define GPIO_INT_EDINTEN_EDIEN_Pos       (0)                                               /*!< GPIO_T::INT_EDINTEN: EDIEN Position    */
#define GPIO_INT_EDINTEN_EDIEN_Msk       (0x1ul << GPIO_INT_EDINTEN_EDIEN_Pos)             /*!< GPIO_T::INT_EDINTEN: EDIEN Mask        */

#define GPIO_INT_EDSTS_EDIF_Pos          (0)                                               /*!< GPIO_T::INT_EDSTS: EDIF Position       */
#define GPIO_INT_EDSTS_EDIF_Msk          (0x1ul << GPIO_INT_EDSTS_EDIF_Pos)                /*!< GPIO_T::INT_EDSTS: EDIF Mask           */

/** @} GPIO_CONST */
/** @} end of GPIO register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __GPIO_REG_H__ */
